## Plan Result (dcd_cftapps_dev_acme)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_group_member.dnszonecontributor
  * azurerm_role_assignment.app-proxy-ga-service-connection-secret-management




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = "a02b18e4-fba7-4d7d-9603-07e128f4126a"
      + id               = (known after apply)
      + member_object_id = "e6dd42d9-61c6-4d29-93b6-7d67b9cf3578"
    }

  # azurerm_role_assignment.app-proxy-ga-service-connection-secret-management will be created
  + resource "azurerm_role_assignment" "app-proxy-ga-service-connection-secret-management" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dad693c4-36ad-468f-94e9-76faa4bc844b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Target":"dcd_cftapps_dev_acme","Vars":{}} -->